Revit 2026 API

# AnalysisResultSchemaCurrentUnits Property

---

Stores the index in the array of applicable units

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int CurrentUnits { get; set; }
```
```vb
Public Property CurrentUnits As Integer
	Get
	Set
```
```cpp
public:
property int CurrentUnits {
	int get ();
	void set (int value);
}
```
```fsharp
member CurrentUnits : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: currentUnits is not in the range from 0 to (number of applicable units - 1) |

Must be between 0 and (number of applicable units - 1)

#### Reference

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace